Dlubal.RFEM5.ImposedNodalDeformation
Imposed nodal deformation parameters.

Dlubal.RFEM5.ImposedNodalDeformation.No
Number

Dlubal.RFEM5.ImposedNodalDeformation.ID
Identifier

Dlubal.RFEM5.ImposedNodalDeformation.Comment
Comment

Dlubal.RFEM5.ImposedNodalDeformation.Tag
Tag

Dlubal.RFEM5.ImposedNodalDeformation.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.ImposedNodalDeformation.NodeList
List of nodes (supports) on which the deformation is defined.

Dlubal.RFEM5.ImposedNodalDeformation.Displacement
Imposed displacement

Dlubal.RFEM5.ImposedNodalDeformation.Rotation
Imposed rotation